adafruit/seesaw/lib/samd21/samd21a/edc/ATSAMD21J16A.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PA04" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT4" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="AIN0" edc:ppsfunction="B" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="AIN4" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="VREFP" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="Y2" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TCC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA05" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT5" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="AIN1" edc:ppsfunction="B" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="AIN5" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="Y3" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TCC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA10" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT10" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="AIN18" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="X2" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="SCK0" edc:ppsfunction="G" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="IO4" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB09" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT9" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="AIN3" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="Y15" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT12" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X12" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC4"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="FS1" edc:ppsfunction="G" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="IO6" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT12" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TCC2"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="H" ltx:memberofperipheral="AC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA18" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X6" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="H" ltx:memberofperipheral="AC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA17" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X5" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TCC2"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO3" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA07" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="AIN3" edc:ppsfunction="B" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="AIN7" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="Y5" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="SD0" edc:ppsfunction="G" ltx:memberofperipheral="I2S"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA06" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="AIN2" edc:ppsfunction="B" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="AIN6" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="Y4" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TCC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA11" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT11" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="AIN19" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="X3" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="FS0" edc:ppsfunction="G" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="IO5" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB10" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT10" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC5"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="MCK1" edc:ppsfunction="G" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="IO4" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB13" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT13" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X13" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC4"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO7" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT13" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TCC2"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="CMP1" edc:ppsfunction="H" ltx:memberofperipheral="AC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA16" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X4" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TCC2"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO2" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA08" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="AIN16" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="X0" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="SD1" edc:ppsfunction="G" ltx:memberofperipheral="I2S"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA09" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT9" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="AIN17" edc:ppsfunction="B" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="X1" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="MCK0" edc:ppsfunction="G" ltx:memberofperipheral="I2S"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB14" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X14" edc:ppsfunction="B" ltx:memberofperipheral="PTC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC5"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="XIN" edc:ppsfunction="XIN" ltx:memberofperipheral="SYSCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="H" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="XOUT" edc:ppsfunction="XOUT" ltx:memberofperipheral="SYSCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDIO"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
